
package step02;

public class Exam09_2 {
    public static void main(String[] args) {
        // 배열 선언
        int[] arr1 = new int[5]; 

        // 배열 메모리 0으로 초기화
        arr1[0] = 0;
        arr1[1] = 0;
        arr1[2] = 0;
        arr1[3] = 0;
        arr1[4] = 0;

        // 1) 배열 선언과 초기화를 한번에 하기
        
        //....int arr2[] = new int[5] {0, 0, 0, 0, 0}; // 오류 !!
        int arr2[] = new int[] {0, 0, 0, 0, 0}; // OK !! 초기화값을쓸떄는 [] 안에 크기를 넣으면 X
        
        // 2) 배열 선언 =====> 초기화 명령
        int arr3[] = {0, 0, 0, 0, 0}; // OK!!
        
        // 3) 배열 선언 후 따로 배열 초기화 문장 실행
        int[] arr4;
        arr4 = new int[]{0, 0, 0, 0};



    }
}

// 배열 초기화 명령
// 1) 배열 선언 + 초기화 
//....데이터타입[] 변수명 = new 데이터타입[]{값,값,값}
//....- 배열 메모리를 초기화시킬 때는 배열 개수를 지정해서는 안된다.
//....- 배열 초기화시키는 값의 개수만큼 알아서 메모리가 만들어진다.
//....ex) int[] arr = new[]{10,20,30};
//....- int 배열은 값 개수만큼 3개가 생성된다.
// 배열 선언 후 따로 배열 초기화 문장 실행
//....데이터타입[] 변수명;
//....변수명 = new 데이터타입[]{값,값,값};
