// 인스턴스 변수
package step08;

public class Exam02_1 {
    
    static class A {
        //1) 클래스 메소드
        // => static이 붙은 메소드
        // => 클래스 이름으로 호출할수있다.
        // => "스태틱 메서드"라고도 부른다.
        static void m1() {
            System.out.println("m1()");
        }
        
        //2) 인스턴스 메서드
        // => static이 붙지 않은 메서드
        // => 인스턴스 주소가 있어야만 호출할 수 있다.
        void m2() {
            System.out.println("m2()");
        }
    }

    public static void main(String[] args) {
        // 클래스 메서드 호출
        // 문법) 클래스명. 메서드명();
        A.m1();
        
        // => 인스턴스 메서드는 클래스 이름으로 호출할수 없다~~~~~~
        //A.m2(); // 컴파일 오류!
        
        A obj1 = new A();
        obj1.m1(); // OK! 그런데 이렇게 하지 말라! (클래스 메소드는 클래스이름으로 선언해라 안헷갈리게)
        
        obj1.m2(); // OK! 인스턴스 메서드를 호출할때는 반드시 인스턴스 주소를 사용하여 호출해야 한다.
        A obj2 = null;
        obj2.m2(); //컴파일 OK! 실행은오류!
                   // 왜? obj2 변수에 들어 있는 인스턴스 주소가 무효하기 때문이다.
    }

}
// 결론!
// 클래스 메서드 (=스태틱 메서드)
// => 인스턴스 변수를 사용하지 않은 경우 클래스 메서드로 선언하라!
// 인스턴스 메서드
// => 인스턴스 변수를 사용할 경우 인스턴스 메서드로 선언하라!
//
// 실무
// => 일단 인스턴스 메서드로 무조건 만들라!
// => 인스턴스 변수를 완전히 사용하지 않음을 확신하면
//    그 때 클래스 메서드로 전환하라!
